src/InformationRegisters/KFK_ИсторияВыполненияЗаданийОбработкиОчереди.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>KFK_ИсторияВыполненияЗаданийОбработкиОчереди</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.KFK_РезультатыВыполненияРегламентныхЗаданий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидОбработкиОчереди</Name>
					<Type>
						<v8:Type>cfg:EnumRef.KFK_ВидыОбработкиОчереди</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ИнформацияОбОшибке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СлужебнаяИнформация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>УникальныйИдентификаторФоновогоЗадания</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/KFK_РезультатыВыполненияРегламентныхЗаданий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>KFK_РезультатыВыполненияРегламентныхЗаданий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Выполнено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыполненоСОшибками</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Невыполнено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполняется</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/InformationRegisters/KFK_ИсторияВыполненияЗаданийОбработкиОчереди/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ДобавитьЗаписьОНачалеВыполненияФоновогоЗадания(Идентификатор, ВидОбработки) Экспорт  
	
	НаборЗаписейФоновогоЗадания = РегистрыСведений.KFK_ИсторияВыполненияЗаданийОбработкиОчереди.СоздатьНаборЗаписей();
	НаборЗаписейФоновогоЗадания.Отбор.УникальныйИдентификаторФоновогоЗадания.Установить(Новый УникальныйИдентификатор(Идентификатор));
	НаборЗаписейФоновогоЗадания.Прочитать();
	
	ТекущаяДатаЗаписи = ТекущаяДата();
	
	Если НаборЗаписейФоновогоЗадания.Количество() = 0 Тогда      
		
		Запись = НаборЗаписейФоновогоЗадания.Добавить();
		Запись.Период = ТекущаяДатаЗаписи;
		Запись.УникальныйИдентификаторФоновогоЗадания = Новый УникальныйИдентификатор(Идентификатор);
		Запись.ВидОбработкиОчереди = ВидОбработки;
		Запись.Состояние = Перечисления.KFK_РезультатыВыполненияРегламентныхЗаданий.Выполняется;
		Запись.ДатаНачала = ТекущаяДатаЗаписи;  
		Запись.ВидОбработкиОчереди = ВидОбработки;
		
		НаборЗаписейФоновогоЗадания.Записать(ложь);       
		
	КонецЕсли;        
	
КонецПроцедуры

Процедура ЗафиксироватьИнформациюОВыполненииФоновогоЗадания(Идентификатор, РегламентнаяОперация, ИнформацияОбОшибке = "") Экспорт
	
	Если Идентификатор = Неопределено ИЛИ Идентификатор = "" Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписейФоновогоЗадания = РегистрыСведений.KFK_ИсторияВыполненияЗаданийОбработкиОчереди.СоздатьНаборЗаписей();
	НаборЗаписейФоновогоЗадания.Отбор.УникальныйИдентификаторФоновогоЗадания.Установить(Новый УникальныйИдентификатор(Идентификатор));
	НаборЗаписейФоновогоЗадания.Прочитать();
	
	Если НаборЗаписейФоновогоЗадания.Количество() Тогда
		Запись = НаборЗаписейФоновогоЗадания[0];
		Запись.Состояние = ?(ИнформацияОбОшибке = "",
							 Перечисления.KFK_ИсторияВыполненияЗаданийОбработкиОчереди.Выполнено,
							 Перечисления.KFK_ИсторияВыполненияЗаданийОбработкиОчереди.ВыполненоСОшибками);
		Запись.ДатаОкончания = ТекущаяДатаСеанса();
		Запись.ИнформацияОбОшибке = ИнформацияОбОшибке;
	КонецЕсли;
	
	НаборЗаписейФоновогоЗадания.Записать(истина);    
	
КонецПроцедуры           

Функция ЕстьАктивнаяОбработкаОчереди(Идентификатор) Экспорт
	
	Результат = Ложь;    
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВИ_ФоновыеЗаданияОбменов.УникальныйИдентификаторФоновогоЗадания КАК УникальныйИдентификаторФоновогоЗадания
	               |ИЗ
	               |	РегистрСведений.KFK_ИсторияВыполненияЗаданийОбработкиОчереди КАК ВИ_ФоновыеЗаданияОбменов
	               |ГДЕ
	               |	ВИ_ФоновыеЗаданияОбменов.УникальныйИдентификаторФоновогоЗадания = &Идентификатор
	               |	И ВИ_ФоновыеЗаданияОбменов.Состояние = &Состояние";   

	Запрос.УстановитьПараметр("Идентификатор", Новый УникальныйИдентификатор(Идентификатор));
	Запрос.УстановитьПараметр("Состояние", Перечисления.KFK_ИсторияВыполненияЗаданийОбработкиОчереди.Выполняется);
	
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Результат = истина;
	КонецЕсли;
	
	Возврат Результат;		
	
КонецФункции

#КонецОбласти

#КонецЕсли
